print("Сегодня хорошая погода!"[-1:-20])


print("Привет мир"[-10:1])

print("Сегодня хорошая погода!")
print("Сегодня хорошая погода!"[8:16])
print("Сегодня хорошая погода!"[0:7])
print("Сегодня хорошая погода!"[-23])
print("Сегодня хорошая погода!"[-1])
print("Сегодня хорошая погода!"[16:23])
print("Сегодня хорошая погода!"[-7:-1])  

print("хорошо"[0:6]) 
print("хорошо"[-6:-1]) 
print("хорошо"[-4]) 
print("хорошо"[2]) 
print("хорошо"[2:4]) 
print("хорошо"[-4:-2]) 
print("STRING"[0:4])
print("STRING"[0:2])
print("STRING"[-6:-2])
print("STRING"[-5:-1])
print("STRING"[2:4])
print("STRING"[-1])
   


